Performancestests/LGOV/SimpleSearch/Baseline-1VU/LGOV-PerfTest-SimpleSearch-Baseline-1VU-RUN1.log
2024-06-28 15:46:11,097 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: Loading user properties from: D:\apache-jmeter-5.4.1\bin\user.properties
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: Loading system properties from: D:\apache-jmeter-5.4.1\bin\system.properties
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: Version 5.4.1
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: java.version=17
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: os.name=Windows Server 2019
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: os.arch=amd64
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: os.version=10.0
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: file.encoding=Cp1252
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: java.awt.headless=true
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: Max memory     =1073741824
2024-06-28 15:46:11,128 INFO o.a.j.JMeter: Available Processors =4
2024-06-28 15:46:11,144 INFO o.a.j.JMeter: Default Locale=English (EN)
2024-06-28 15:46:11,144 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2024-06-28 15:46:11,144 INFO o.a.j.JMeter: JMeterHome=D:\apache-jmeter-5.4.1
2024-06-28 15:46:11,144 INFO o.a.j.JMeter: user.dir  =D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU
2024-06-28 15:46:11,144 INFO o.a.j.JMeter: PWD       =D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU
2024-06-28 15:46:11,144 INFO o.a.j.JMeter: IP: 172.26.0.23 Name: dev-load FullName: dev-load.gla.london.gov.uk
2024-06-28 15:46:11,159 INFO o.a.j.s.FileServer: Default base='D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU'
2024-06-28 15:46:11,159 INFO o.a.j.s.FileServer: Set new base='D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU'
2024-06-28 15:46:11,316 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2024-06-28 15:46:11,331 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2024-06-28 15:46:11,331 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2024-06-28 15:46:11,347 INFO o.a.j.s.SaveService: Loading file: D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU\LGOV-Search-Baseline-1VU.jmx
2024-06-28 15:46:11,409 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2024-06-28 15:46:11,409 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2024-06-28 15:46:11,409 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-06-28 15:46:11,409 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-06-28 15:46:11,409 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-06-28 15:46:11,409 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-06-28 15:46:11,409 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2024-06-28 15:46:11,409 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2024-06-28 15:46:11,441 INFO o.a.j.JMeter: Creating summariser <summary>
2024-06-28 15:46:11,456 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2024-06-28 15:46:11,456 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2024-06-28 15:46:11,456 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2024-06-28 15:46:11,472 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2024-06-28 15:46:11,472 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2024-06-28 15:46:11,570 INFO o.a.j.JMeter: Running test (1719585971570)
2024-06-28 15:46:11,602 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Baseline 1VU
2024-06-28 15:46:11,602 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Baseline 1VU.
2024-06-28 15:46:11,602 INFO o.a.j.e.StandardJMeterEngine: Thread will start next loop on error
2024-06-28 15:46:11,602 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 1
2024-06-28 15:46:11,602 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2024-06-28 15:46:11,602 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2024-06-28 15:46:11,648 INFO o.a.j.t.JMeterThread: Thread started: Baseline 1VU 1-1
2024-06-28 15:46:11,648 INFO o.a.j.s.FileServer: Stored: D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU\SearchTerms.csv
2024-06-28 15:46:16,440 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = dev-load
2024-06-28 15:46:16,456 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2024-06-28 15:46:16,456 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2024-06-28 15:46:16,456 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2024-06-28 15:46:16,456 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2024-06-28 15:46:16,456 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2024-06-28 15:46:16,540 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2024-06-28 15:46:16,540 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2024-06-28 15:46:16,540 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2024-06-28 15:46:16,630 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2024-06-28 15:46:16,630 INFO o.a.j.u.SSLManager: KeyStore created OK
2024-06-28 15:46:16,630 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2024-06-28 15:46:16,990 INFO o.a.j.p.h.p.BaseParser: Created org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-06-28 15:46:17,084 INFO o.a.j.p.h.s.ResourcesDownloader: Creating ResourcesDownloader with keepalive_inseconds : 60
2024-06-28 15:46:17,190 INFO o.a.j.p.h.p.BaseParser: Created org.apache.jmeter.protocol.http.parser.CssParser
2024-06-28 15:46:17,190 INFO o.a.j.p.h.p.BaseParser: Created org.apache.jmeter.protocol.http.parser.CssParser
2024-06-28 15:47:01,014 INFO o.a.j.r.Summariser: summary +      8 in 00:00:49 =    0.2/s Avg:  1239 Min:   139 Max:  1694 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:47:34,264 INFO o.a.j.r.Summariser: summary +      5 in 00:00:33 =    0.2/s Avg:  1566 Min:  1358 Max:  1729 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:47:34,264 INFO o.a.j.r.Summariser: summary =     13 in 00:01:23 =    0.2/s Avg:  1365 Min:   139 Max:  1729 Err:     0 (0.00%)
2024-06-28 15:48:00,947 INFO o.a.j.r.Summariser: summary +      4 in 00:00:27 =    0.1/s Avg:  1469 Min:  1330 Max:  1579 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:48:00,947 INFO o.a.j.r.Summariser: summary =     17 in 00:01:49 =    0.2/s Avg:  1389 Min:   139 Max:  1729 Err:     0 (0.00%)
2024-06-28 15:48:34,051 INFO o.a.j.r.Summariser: summary +      5 in 00:00:33 =    0.2/s Avg:  1387 Min:  1298 Max:  1568 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:48:34,051 INFO o.a.j.r.Summariser: summary =     22 in 00:02:22 =    0.2/s Avg:  1389 Min:   139 Max:  1729 Err:     0 (0.00%)
2024-06-28 15:49:00,417 INFO o.a.j.r.Summariser: summary +      4 in 00:00:26 =    0.2/s Avg:  1465 Min:  1302 Max:  1575 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:49:00,417 INFO o.a.j.r.Summariser: summary =     26 in 00:02:49 =    0.2/s Avg:  1400 Min:   139 Max:  1729 Err:     0 (0.00%)
2024-06-28 15:49:35,283 INFO o.a.j.r.Summariser: summary +      5 in 00:00:35 =    0.1/s Avg:  1589 Min:  1232 Max:  1982 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:49:35,283 INFO o.a.j.r.Summariser: summary =     31 in 00:03:24 =    0.2/s Avg:  1431 Min:   139 Max:  1982 Err:     0 (0.00%)
2024-06-28 15:50:01,627 INFO o.a.j.r.Summariser: summary +      4 in 00:00:26 =    0.2/s Avg:  1381 Min:  1107 Max:  1595 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:50:01,643 INFO o.a.j.r.Summariser: summary =     35 in 00:03:50 =    0.2/s Avg:  1425 Min:   139 Max:  1982 Err:     0 (0.00%)
2024-06-28 15:50:34,664 INFO o.a.j.r.Summariser: summary +      5 in 00:00:33 =    0.2/s Avg:  1292 Min:   969 Max:  1545 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:50:34,665 INFO o.a.j.r.Summariser: summary =     40 in 00:04:23 =    0.2/s Avg:  1408 Min:   139 Max:  1982 Err:     0 (0.00%)
2024-06-28 15:51:02,125 INFO o.a.j.r.Summariser: summary +      4 in 00:00:27 =    0.1/s Avg:  1450 Min:  1332 Max:  1627 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:51:02,125 INFO o.a.j.r.Summariser: summary =     44 in 00:04:51 =    0.2/s Avg:  1412 Min:   139 Max:  1982 Err:     0 (0.00%)
2024-06-28 15:51:32,860 INFO o.a.j.r.Summariser: summary +      5 in 00:00:31 =    0.2/s Avg:  1556 Min:  1299 Max:  1823 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:51:32,860 INFO o.a.j.r.Summariser: summary =     49 in 00:05:21 =    0.2/s Avg:  1427 Min:   139 Max:  1982 Err:     0 (0.00%)
2024-06-28 15:52:04,955 INFO o.a.j.r.Summariser: summary +      5 in 00:00:32 =    0.2/s Avg:  1509 Min:  1228 Max:  2209 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:52:04,955 INFO o.a.j.r.Summariser: summary =     54 in 00:05:53 =    0.2/s Avg:  1435 Min:   139 Max:  2209 Err:     0 (0.00%)
2024-06-28 15:52:32,091 INFO o.a.j.r.Summariser: summary +      4 in 00:00:27 =    0.1/s Avg:  1402 Min:   952 Max:  1908 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:52:32,091 INFO o.a.j.r.Summariser: summary =     58 in 00:06:21 =    0.2/s Avg:  1432 Min:   139 Max:  2209 Err:     0 (0.00%)
2024-06-28 15:53:03,234 INFO o.a.j.r.Summariser: summary +      5 in 00:00:31 =    0.2/s Avg:  1278 Min:  1135 Max:  1425 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:53:03,250 INFO o.a.j.r.Summariser: summary =     63 in 00:06:52 =    0.2/s Avg:  1420 Min:   139 Max:  2209 Err:     0 (0.00%)
2024-06-28 15:53:33,427 INFO o.a.j.r.Summariser: summary +      5 in 00:00:30 =    0.2/s Avg:  1421 Min:  1339 Max:  1563 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:53:33,427 INFO o.a.j.r.Summariser: summary =     68 in 00:07:22 =    0.2/s Avg:  1420 Min:   139 Max:  2209 Err:     0 (0.00%)
2024-06-28 15:54:04,028 INFO o.a.j.r.Summariser: summary +      5 in 00:00:31 =    0.2/s Avg:  1195 Min:  1020 Max:  1442 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:54:04,028 INFO o.a.j.r.Summariser: summary =     73 in 00:07:52 =    0.2/s Avg:  1405 Min:   139 Max:  2209 Err:     0 (0.00%)
2024-06-28 15:55:01,184 INFO o.a.j.r.Summariser: summary +      9 in 00:00:57 =    0.2/s Avg:  1630 Min:  1115 Max:  2616 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:55:01,184 INFO o.a.j.r.Summariser: summary =     82 in 00:08:50 =    0.2/s Avg:  1429 Min:   139 Max:  2616 Err:     0 (0.00%)
2024-06-28 15:55:34,981 INFO o.a.j.r.Summariser: summary +      5 in 00:00:34 =    0.1/s Avg:  1590 Min:  1441 Max:  1787 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:55:34,981 INFO o.a.j.r.Summariser: summary =     87 in 00:09:23 =    0.2/s Avg:  1439 Min:   139 Max:  2616 Err:     0 (0.00%)
2024-06-28 15:56:00,935 INFO o.a.j.r.Summariser: summary +      4 in 00:00:26 =    0.2/s Avg:  1453 Min:  1356 Max:  1541 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-06-28 15:56:00,935 INFO o.a.j.r.Summariser: summary =     91 in 00:09:49 =    0.2/s Avg:  1439 Min:   139 Max:  2616 Err:     0 (0.00%)
2024-06-28 15:56:20,641 INFO o.a.j.t.JMeterThread: Thread finished: Baseline 1VU 1-1
2024-06-28 15:56:20,641 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2024-06-28 15:56:20,641 INFO o.a.j.s.FileServer: Close: D:\++ WORK ++\-- LGOV --\Drupal10\PERF_TESTS\Search\Baseline-1VU\SearchTerms.csv
2024-06-28 15:56:20,649 INFO o.a.j.r.Summariser: summary +      3 in 00:00:20 =    0.2/s Avg:  1750 Min:  1607 Max:  1969 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2024-06-28 15:56:20,649 INFO o.a.j.r.Summariser: summary =     94 in 00:10:09 =    0.2/s Avg:  1449 Min:   139 Max:  2616 Err:     0 (0.00%)